name = input('Введите ваше имя: ')
birth = input('Введите дату рождения: ')
sity = input('Введите город в котором вы родились: ')
school = input('В какой школе вы учитесь? ')
hobby = input('Какое у вас хобби? ')
football = input('Ваш любимый футбольный клуб? ')
favorite = input('Какой ваш любимый футболист? ')




print(f'Меня зовут {name}, я родился {birth}, в городе {sity}. Учусь в школе {school}. Моё главное увлечение – это {hobby}. Моя любимая футбольная команда – это Реал Мадрид.Мой любимый футболист – Роналду.')





























